Kim-Hyundo/CSA_SW_TEST_SOLUTION/Workspace/GHS_Test/Target_SW/BSW/Modules/b_pf_autosar_tc39x_bundle/delivery/generic_TC39X_inc/IfxDmu_reg.h
/** \brief 10444, PFLASH Bank 4 OTP Protection Configuration 1 */
#define DMU_HP4_PROCON_OTP1 /*lint --e(923, 9078)*/ (*(volatile Ifx_DMU_HP_PROCON_OTP1*)0xF8050444u)
/** Alias (User Manual Name) for DMU_HP4_PROCON_OTP1.
* To use register names with standard convension, please use DMU_HP4_PROCON_OTP1.
*/
#define DMU_HP_PROCONOTP41 (DMU_HP4_PROCON_OTP1)

/** \brief 10448, PFLASH Bank 4 OTP Protection Configuration 2 */
#define DMU_HP4_PROCON_OTP2 /*lint --e(923, 9078)*/ (*(volatile Ifx_DMU_HP_PROCON_OTP2*)0xF8050448u)
/** Alias (User Manual Name) for DMU_HP4_PROCON_OTP2.
* To use register names with standard convension, please use DMU_HP4_PROCON_OTP2.
*/
#define DMU_HP_PROCONOTP42 (DMU_HP4_PROCON_OTP2)

/** \brief 1044C, PFLASH Bank 4 OTP Protection Configuration 3 */
#define DMU_HP4_PROCON_OTP3 /*lint --e(923, 9078)*/ (*(volatile Ifx_DMU_HP_PROCON_OTP3*)0xF805044Cu)
/** Alias (User Manual Name) for DMU_HP4_PROCON_OTP3.
* To use register names with standard convension, please use DMU_HP4_PROCON_OTP3.
*/
#define DMU_HP_PROCONOTP43 (DMU_HP4_PROCON_OTP3)

/** \brief 10450, PFLASH Bank 4 OTP Protection Configuration 4 */
#define DMU_HP4_PROCON_OTP4 /*lint --e(923, 9078)*/ (*(volatile Ifx_DMU_HP_PROCON_OTP4*)0xF8050450u)
/** Alias (User Manual Name) for DMU_HP4_PROCON_OTP4.
* To use register names with standard convension, please use DMU_HP4_PROCON_OTP4.
*/
#define DMU_HP_PROCONOTP44 (DMU_HP4_PROCON_OTP4)

/** \brief 10454, PFLASH Bank 4 OTP Protection Configuration 5 */
#define DMU_HP4_PROCON_OTP5 /*lint --e(923, 9078)*/ (*(volatile Ifx_DMU_HP_PROCON_OTP5*)0xF8050454u)
/** Alias (User Manual Name) for DMU_HP4_PROCON_OTP5.
* To use register names with standard convension, please use DMU_HP4_PROCON_OTP5.
*/
#define DMU_HP_PROCONOTP45 (DMU_HP4_PROCON_OTP5)

/** \brief 10480, PFLASH Bank 4 WOP Configuration 0 */
#define DMU_HP4_PROCON_WOP0 /*lint --e(923, 9078)*/ (*(volatile Ifx_DMU_HP_PROCON_WOP0*)0xF8050480u)
/** Alias (User Manual Name) for DMU_HP4_PROCON_WOP0.
* To use register names with standard convension, please use DMU_HP4_PROCON_WOP0.
*/
#define DMU_HP_PROCONWOP40 (DMU_HP4_PROCON_WOP0)

/** \brief 10484, PFLASH Bank 4 WOP Configuration 1 */
#define DMU_HP4_PROCON_WOP1 /*lint --e(923, 9078)*/ (*(volatile Ifx_DMU_HP_PROCON_WOP1*)0xF8050484u)
/** Alias (User Manual Name) for DMU_HP4_PROCON_WOP1.
* To use register names with standard convension, please use DMU_HP4_PROCON_WOP1.
*/
#define DMU_HP_PROCONWOP41 (DMU_HP4_PROCON_WOP1)

/** \brief 10488, PFLASH Bank 4 WOP Configuration 2 */
#define DMU_HP4_PROCON_WOP2 /*lint --e(923, 9078)*/ (*(volatile Ifx_DMU_HP_PROCON_WOP2*)0xF8050488u)
/** Alias (User Manual Name) for DMU_HP4_PROCON_WOP2.
* To use register names with standard convension, please use DMU_HP4_PROCON_WOP2.
*/
#define DMU_HP_PROCONWOP42 (DMU_HP4_PROCON_WOP2)

/** \brief 1048C, PFLASH Bank 4 WOP Configuration 3 */
#define DMU_HP4_PROCON_WOP3 /*lint --e(923, 9078)*/ (*(volatile Ifx_DMU_HP_PROCON_WOP3*)0xF805048Cu)
/** Alias (User Manual Name) for DMU_HP4_PROCON_WOP3.
* To use register names with standard convension, please use DMU_HP4_PROCON_WOP3.
*/
#define DMU_HP_PROCONWOP43 (DMU_HP4_PROCON_WOP3)

/** \brief 10490, PFLASH Bank 4 WOP Configuration 4 */
#define DMU_HP4_PROCON_WOP4 /*lint --e(923, 9078)*/ (*(volatile Ifx_DMU_HP_PROCON_WOP4*)0xF8050490u)
/** Alias (User Manual Name) for DMU_HP4_PROCON_WOP4.
* To use register names with standard convension, please use DMU_HP4_PROCON_WOP4.
*/
#define DMU_HP_PROCONWOP44 (DMU_HP4_PROCON_WOP4)

/** \brief 10494, PFLASH Bank 4 WOP Configuration 5 */
#define DMU_HP4_PROCON_WOP5 /*lint --e(923, 9078)*/ (*(volatile Ifx_DMU_HP_PROCON_WOP5*)0xF8050494u)
/** Alias (User Manual Name) for DMU_HP4_PROCON_WOP5.
* To use register names with standard convension, please use DMU_HP4_PROCON_WOP5.
*/
#define DMU_HP_PROCONWOP45 (DMU_HP4_PROCON_WOP5)

/** \brief 104A0, PFLASH Bank 4 Erase Counter Priority configuration 0 */
#define DMU_HP4_ECPRIO_P0 /*lint --e(923, 9078)*/ (*(volatile Ifx_DMU_HP_ECPRIO_P0*)0xF80504A0u)
/** Alias (User Manual Name) for DMU_HP4_ECPRIO_P0.
* To use register names with standard convension, please use DMU_HP4_ECPRIO_P0.
*/
#define DMU_HP_ECPRIO40 (DMU_HP4_ECPRIO_P0)

/** \brief 104A4, PFLASH Bank 4 Erase Counter Priority Configuration 1 */
#define DMU_HP4_ECPRIO_P1 /*lint --e(923, 9078)*/ (*(volatile Ifx_DMU_HP_ECPRIO_P1*)0xF80504A4u)
/** Alias (User Manual Name) for DMU_HP4_ECPRIO_P1.
* To use register names with standard convension, please use DMU_HP4_ECPRIO_P1.
*/
#define DMU_HP_ECPRIO41 (DMU_HP4_ECPRIO_P1)

/** \brief 104A8, PFLASH Bank 4 Erase Counter Priority Configuration 2 */
#define DMU_HP4_ECPRIO_P2 /*lint --e(923, 9078)*/ (*(volatile Ifx_DMU_HP_ECPRIO_P2*)0xF80504A8u)
/** Alias (User Manual Name) for DMU_HP4_ECPRIO_P2.
* To use register names with standard convension, please use DMU_HP4_ECPRIO_P2.
*/
#define DMU_HP_ECPRIO42 (DMU_HP4_ECPRIO_P2)

/** \brief 104AC, PFLASH Bank 4 Erase Counter Priority Configuration 3 */
#define DMU_HP4_ECPRIO_P3 /*lint --e(923, 9078)*/ (*(volatile Ifx_DMU_HP_ECPRIO_P3*)0xF80504ACu)
/** Alias (User Manual Name) for DMU_HP4_ECPRIO_P3.
* To use register names with standard convension, please use DMU_HP4_ECPRIO_P3.
*/
#define DMU_HP_ECPRIO43 (DMU_HP4_ECPRIO_P3)

/** \brief 104B0, PFLASH Bank 4 Erase Counter Priority Configuration 4 */
#define DMU_HP4_ECPRIO_P4 /*lint --e(923, 9078)*/ (*(volatile Ifx_DMU_HP_ECPRIO_P4*)0xF80504B0u)
/** Alias (User Manual Name) for DMU_HP4_ECPRIO_P4.
* To use register names with standard convension, please use DMU_HP4_ECPRIO_P4.
*/
#define DMU_HP_ECPRIO44 (DMU_HP4_ECPRIO_P4)

/** \brief 104B4, PFLASH Bank 4 Erase Counter Priority Configuration 5 */
#define DMU_HP4_ECPRIO_P5 /*lint --e(923, 9078)*/ (*(volatile Ifx_DMU_HP_ECPRIO_P5*)0xF80504B4u)
/** Alias (User Manual Name) for DMU_HP4_ECPRIO_P5.
* To use register names with standard convension, please use DMU_HP4_ECPRIO_P5.
*/
#define DMU_HP_ECPRIO45 (DMU_HP4_ECPRIO_P5)

/** \brief 10500, PFLASH Bank 5 Protection Configuration 0 */
#define DMU_HP5_PROCON_P0 /*lint --e(923, 9078)*/ (*(volatile Ifx_DMU_HP_PROCON_P0*)0xF8050500u)
/** Alias (User Manual Name) for DMU_HP5_PROCON_P0.
* To use register names with standard convension, please use DMU_HP5_PROCON_P0.
*/
#define DMU_HP_PROCONP50 (DMU_HP5_PROCON_P0)

/** \brief 10504, PFLASH Bank 5 Protection Configuration 1 */
#define DMU_HP5_PROCON_P1 /*lint --e(923, 9078)*/ (*(volatile Ifx_DMU_HP_PROCON_P1*)0xF8050504u)
/** Alias (User Manual Name) for DMU_HP5_PROCON_P1.
* To use register names with standard convension, please use DMU_HP5_PROCON_P1.
*/
#define DMU_HP_PROCONP51 (DMU_HP5_PROCON_P1)

/** \brief 10508, PFLASH Bank 5 Protection Configuration 2 */
#define DMU_HP5_PROCON_P2 /*lint --e(923, 9078)*/ (*(volatile Ifx_DMU_HP_PROCON_P2*)0xF8050508u)
/** Alias (User Manual Name) for DMU_HP5_PROCON_P2.
* To use register names with standard convension, please use DMU_HP5_PROCON_P2.
*/
#define DMU_HP_PROCONP52 (DMU_HP5_PROCON_P2)

/** \brief 1050C, PFLASH Bank 5 Protection Configuration 3 */
#define DMU_HP5_PROCON_P3 /*lint --e(923, 9078)*/ (*(volatile Ifx_DMU_HP_PROCON_P3*)0xF805050Cu)
/** Alias (User Manual Name) for DMU_HP5_PROCON_P3.
* To use register names with standard convension, please use DMU_HP5_PROCON_P3.
*/
#define DMU_HP_PROCONP53 (DMU_HP5_PROCON_P3)

